# CLI tools.
brew "bat"
brew "fd"
brew "fzf"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gh"
brew "git"
brew "jq"
brew "libpq"
brew "mise"
brew "neovim"
brew "starship"
brew "tmux"

# Fonts.
# Ioskeley NL Nerd Font (sin ligaturas + Nerd Font glyphs) — no hay cask oficial,
# se instala desde el release de GitHub via install.sh.

# Terminals and editors.
cask "alacritty"
cask "visual-studio-code"

# AI tools.
cask "ollama-app"
cask "claude"
cask "claude-code"
cask "chatgpt"

# Browsers.
cask "google-chrome"

# Dev / infra.
cask "docker-desktop"
cask "postico"
cask "nosql-workbench"
cask "aws-vpn-client"
cask "proxyman"

# Productivity.
cask "linear"
cask "kap"
cask "obsidian"
cask "notion"
cask "hammerspoon"

# Communication.
cask "slack"
cask "telegram"
cask "whatsapp"
cask "gather"

# Personal.
cask "ledger-wallet"
cask "nordvpn"
