# CLI tools.
brew "bat"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "git"
brew "jq"
brew "libpq"
brew "mise"
brew "neovim"
brew "starship"
brew "tmux"

# Fonts.
cask "font-monaspace"
cask "font-jetbrains-mono-nerd-font"

# Terminals and editors.
cask "alacritty"
cask "visual-studio-code"

# AI tools.
cask "ollama-app"
cask "codex"
cask "claude"
cask "claude-code"
cask "chatgpt"

# Browsers.
cask "google-chrome"
cask "firefox"

# Dev / infra.
cask "docker-desktop"
cask "tableplus"
cask "nosql-workbench"
cask "aws-vpn-client"
cask "postman"
cask "proxyman"

# Productivity.
cask "linear"
cask "kap"
cask "1password"
cask "1password-cli"
cask "obsidian"
cask "hammerspoon"

# Communication.
cask "slack"
cask "telegram"
cask "whatsapp"
cask "gather"
cask "discord"

# Personal.
cask "ledger-wallet"
cask "nordvpn"
cask "tidal"
