brew "bat"
brew "fd"
brew "fzf"
brew "ripgrep"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "gh"
brew "git"
brew "jq"
brew "lazygit"
brew "libpq"
brew "mise"
brew "neovim"
brew "starship"
brew "tmux"

cask "alacritty"
cask "visual-studio-code"

cask "ollama-app"
cask "claude"
cask "claude-code@latest"
cask "chatgpt"

cask "google-chrome"

brew "container"
brew "lazydocker"
cask "docker-desktop"
cask "datagrip"
cask "bruno"
cask "aws-vpn-client"

cask "linear"
cask "cap"
cask "obsidian"
cask "notion"
cask "hammerspoon"

cask "slack"
cask "telegram"
cask "whatsapp"
cask "gather"

cask "ledger-wallet"
cask "nordvpn"
